app/Controllers/Admin/AuthController.php

SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function processLogin()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Username dan password wajib diisi.');
        }

        $adminModel = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $adminModel->where('username', $username)->first();