app/Controllers/Admin/PendaftarController.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $query = $this->pendaftarModel;

        if ($keyword) {
            $query = $query
                ->groupStart()
                ->like('nama_lengkap', $keyword)
                ->orLike('nim', $keyword)
                ->orLike('prodi', $keyword)
                ->orLike('status', $keyword)
                ->groupEnd();
        }

       $data = [
    'pendaftar' => $query->orderBy('id', 'DESC')->findAll(),
    'keyword'   => $keyword,

    'total'     => (new PendaftarModel())->countAllResults(),
    'menunggu'  => (new PendaftarModel())->where('status', 'Menunggu Seleksi')->countAllResults(),
    'diterima'  => (new PendaftarModel())->where('status', 'Diterima')->countAllResults(),
    'ditolak'   => (new PendaftarModel())->where('status', 'Ditolak')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `pendaftar`
SELECT COUNT(*) AS `numrows`
FROM `pendaftar`
WHERE `status` = 'Menunggu Seleksi'
SELECT COUNT(*) AS `numrows`
FROM `pendaftar`
WHERE `status` = 'Diterima'
SELECT COUNT(*) AS `numrows`
FROM `pendaftar`
WHERE `status` = 'Ditolak'

    public function show($id)
{
    $pendaftar = $this->pendaftarModel->find($id);
---
SELECT *
FROM `pendaftar`
WHERE `pendaftar`.`id` = '1'